БИТУправление_медицинским_центром_демо/src/Reports/РасшифровкаМедицинскогоОтчетаФорма16вн_2022/РасшифровкаМедицинскогоОтчетаФорма16вн_2022.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РасшифровкаМедицинскогоОтчетаФорма16вн_2022</name>
</mdclass:Report>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/СтатусыОбменаФСС/СтатусыОбменаФСС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыОбменаФСС</name>
  <resources>
    <name>СтатусФСС</name>
    <type>
      <types>EnumRef.СтатусыФСС</types>
    </type>
  </resources>
  <resources>
    <name>Операция</name>
    <comment>0 - Нет 1 - Отправка 2 - Обновление 3 - Аннулирование</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыФСС</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ЛистокНетрудоспособности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/СтатусыФСС/СтатусыФСС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыФСС</name>
  <enumValues>
    <name>ЭЛНОткрыт</name>
    <comment>010</comment>
  </enumValues>
  <enumValues>
    <name>ЭЛНПродлен</name>
    <comment>020</comment>
  </enumValues>
  <enumValues>
    <name>ЭЛНЗакрыт</name>
    <comment>030</comment>
  </enumValues>
  <enumValues>
    <name>ЭЛННаправлениеНаМСЭ</name>
    <comment>040</comment>
  </enumValues>
  <enumValues>
    <name>ЭЛНДополненДаннымиМСЭ</name>
    <comment>050</comment>
  </enumValues>
  <enumValues>
    <name>ЭЛНЗаполненСтрахователем</name>
    <comment>060</comment>
  </enumValues>
  <enumValues>
    <name>ЭЛНЗаполненСтрахователемПВСО</name>
    <comment>070</comment>
  </enumValues>
  <enumValues>
    <name>ПособиеВыплачено</name>
    <comment>080</comment>
  </enumValues>
  <enumValues>
    <name>ДействияПрекращены</name>
    <comment>090</comment>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ОтправленУспешно</name>
  </enumValues>
  <enumValues>
    <name>НеПринятФСС</name>
  </enumValues>
  <enumValues>
    <name>Обновлен</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>Редактируется</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыЛистковНетрудоспособности/ВидыЛистковНетрудоспособности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЛистковНетрудоспособности</name>
  <enumValues>
    <name>Первичный</name>
  </enumValues>
  <enumValues>
    <name>ДругогоЛПУ</name>
  </enumValues>
  <enumValues>
    <name>Продолжение</name>
  </enumValues>
  <enumValues>
    <name>ПродолжениеДругогоЛПУ</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ПолФизическихЛиц/ПолФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолФизическихЛиц</name>
  <comment>Пол физических лиц</comment>
  <enumValues>
    <name>НеУказан</name>
    <comment>Пол не указан</comment>
  </enumValues>
  <enumValues>
    <name>Мужской</name>
    <comment>Пол мужской</comment>
  </enumValues>
  <enumValues>
    <name>Женский</name>
    <comment>Пол женский</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Reports/РасшифровкаМедицинскогоОтчетаФорма16вн_2022/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
		
	Таблица = ПолучитьДиагнозы();
	
	ВнешниеНаборыДанных = Новый Структура("Данные",Таблица);
	
	ОсновнойМакетОформления = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойМакетОформленияСКД");
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	ПараметрМакет = КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("МакетОформления");
	ПараметрМакет.Значение = ОсновнойМакетОформления;
	ПараметрМакет.Использование = Истина;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();    
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	// Инициализация процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	// Получение результата
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьДокумент(ДокументРезультат);
	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДиагнозы()
	
	ПараметрыОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	
	ДатаНачало = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала;
	ДатаОкончание = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачало);
	Запрос.УстановитьПараметр("КонецПериода",  ДатаОкончание);
	Запрос.УстановитьПараметр("СписокФилиалов", ПараметрыОтчета.Найти("СписокФилиалов").Значение);
	Запрос.УстановитьПараметр("Страница", ПараметрыОтчета.Найти("Страница").Значение);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		           |	ВЫБОР
               	   |		КОГДА ТИПЗНАЧЕНИЯ(ЛистокНетрудоспособности.ДиагнозПоМКБ10) = ТИП(Справочник.Диагнозы)
                   |			ТОГДА ЛистокНетрудоспособности.ДиагнозПоМКБ10.КодДиагноза
	               |		ИНАЧЕ ВЫРАЗИТЬ(ЛистокНетрудоспособности.ДиагнозПоМКБ10 КАК СТРОКА(10))
    	           |	КОНЕЦ КАК КодДиагноза,
                   |	РАЗНОСТЬДАТ(ЛистокНетрудоспособности.ДатаРождения, ЛистокНетрудоспособности.ДатаОкончания, ГОД) - ВЫБОР
    	           |		КОГДА ДЕНЬГОДА(ЛистокНетрудоспособности.Клиент.ДатаРождения) > ДЕНЬГОДА(ЛистокНетрудоспособности.ДатаОкончания)
                   |			ТОГДА 1
                   |		ИНАЧЕ 0
                   |	КОНЕЦ КАК Возраст,
	               |	ВЫБОР
            	   |		КОГДА ЛистокНетрудоспособности.ДокументОснование = ЗНАЧЕНИЕ(Документ.ЛистокНетрудоспособности.ПустаяСсылка)
	               |				ИЛИ ЛистокНетрудоспособности.ДокументОснование = НЕОПРЕДЕЛЕНО
	               |			ТОГДА """"
	               |		ИНАЧЕ ЛистокНетрудоспособности.ДокументОснование
	               |	КОНЕЦ КАК ПредыдущийЛН, 
				   |    ЛистокНетрудоспособности.Номер КАК Номер,
				   |    ЛистокНетрудоспособности.Пол КАК Пол,
	               |	ЛистокНетрудоспособности.ПричинаНетрудоспособности.Код КАК ПричинаНетрудоспособностиКод,
	               |	РАЗНОСТЬДАТ(ЛистокНетрудоспособности.Запись1ДатаНачала, ЛистокНетрудоспособности.ДатаОкончания, ДЕНЬ) + 1 КАК Дней,
	               |	СтатусыОбменаФСС.СтатусФСС КАК СтатусФСС, 
				   |    ЛистокНетрудоспособности.Клиент КАК Клиент,
				   |    ЛистокНетрудоспособности.Ссылка КАК Документ,
				   |    ЛистокНетрудоспособности.ДиагнозПоМКБ10 КАК Диагноз,
	               |	ЛистокНетрудоспособности.ПричинаНетрудоспособности КАК ПричинаНетрудоспособности
				   |ПОМЕСТИТЬ СписокДиагнозов
	               |ИЗ
	               |	Документ.ЛистокНетрудоспособности КАК ЛистокНетрудоспособности
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОбменаФСС КАК СтатусыОбменаФСС
	               |		ПО ЛистокНетрудоспособности.Ссылка = СтатусыОбменаФСС.Объект
	               |ГДЕ
	               |	ЛистокНетрудоспособности.Филиал В(&СписокФилиалов)
	               |	И СтатусыОбменаФСС.СтатусФСС = ЗНАЧЕНИЕ(Перечисление.СтатусыФСС.ЭЛНЗакрыт)
	               |	И (ЛистокНетрудоспособности.Запись1ДатаНачала >= &НачалоПериода
	               |				И ЛистокНетрудоспособности.ДатаОкончания <= &КонецПериода
	               |			ИЛИ ЛистокНетрудоспособности.Запись1ДатаНачала < &НачалоПериода
	               |				И (ЛистокНетрудоспособности.ДатаОкончания >= &НачалоПериода И ЛистокНетрудоспособности.ДатаОкончания<=&КонецПериода))
	               |	И ЛистокНетрудоспособности.ЛПУОГРН = ЛистокНетрудоспособности.Филиал.Организация.ОГРН
	               |	И НЕ ЛистокНетрудоспособности.ПометкаУдаления
	               |	И (ЛистокНетрудоспособности.ВидЛистка = ЗНАЧЕНИЕ(Перечисление.ВидыЛистковНетрудоспособности.Первичный)
	               |				И ЛистокНетрудоспособности.СледующийЛН = """"
	               |			ИЛИ ЛистокНетрудоспособности.ВидЛистка = ЗНАЧЕНИЕ(Перечисление.ВидыЛистковНетрудоспособности.Продолжение)
	               |				И ЛистокНетрудоспособности.СледующийЛН = """")
				   |    И ЛистокНетрудоспособности.РабочийКонтур = ложь	
	               |;
				   |////////////////////////////////////////////////////////////////////////////////
				   |
				   |ВЫБРАТЬ
	 	           |    СписокДиагнозов.Документ КАК ЛистНетрудоспособности,
	 	           |    СписокДиагнозов.ПредыдущийЛН КАК ПредыдущийЛН
	               |ИЗ
	 	           |    СписокДиагнозов КАК СписокДиагнозов
	               |ГДЕ
	 	           |    СписокДиагнозов.ПредыдущийЛН <> """"
				   |;
				   |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СписокДиагнозов.Документ КАК Документ,
	               |	СписокДиагнозов.Клиент КАК Клиент,
	               |	СписокДиагнозов.Диагноз КАК Диагноз,
	               |	СписокДиагнозов.Дней КАК КоличествоДней,
	               |	СписокДиагнозов.ПричинаНетрудоспособности КАК Причина
	               |ИЗ
	               |	СписокДиагнозов КАК СписокДиагнозов
	               |ГДЕ
	               |	ИСТИНА";
	ДобавитьГруппыВТекстЗапроса(Запрос.Текст, ПараметрыОтчета.Найти("Группа").Значение);
	Запрос.Текст = Запрос.Текст + ПараметрыОтчета.Найти("Колонка").Значение;
	ОбщийРезультат = Запрос.ВыполнитьПакет(); 
	Результат = ОбщийРезультат[2].Выгрузить();
	
	// Добавим дни и первоначальный номер ЛН (для случаев,имеющих несколько документов ЛН)
	
	// Вычитываем доп. дни по случаям, в которых несколько БЛ. 
	БЛДни = ОбщийРезультат[1].Выгрузить();
	БЛДни.Колонки.Добавить("Дни");  
	БЛДни.Колонки.Добавить("ПервичныйЛисток");
	БЛДни.ЗаполнитьЗначения(0, "Дни");
	Для Каждого Стр Из БЛДни Цикл
		Стр.ПервичныйЛисток = Стр.ЛистНетрудоспособности;
	КонецЦикла;	
		
	Счетчик = БЛДни.Количество();
	Пока Счетчик <>0 Цикл  
		Для Каждого Стр из БЛДни Цикл 
			Если Стр.ПредыдущийЛН <> "" Тогда
			    Если ТипЗНЧ(Стр.ПредыдущийЛН) = Тип("Строка") Тогда 
				    Номер = Число(Стр.ПредыдущийЛН); 
				    СсылкаНаЛН = Документы.ЛистокНетрудоспособности.НайтиПоНомеру(Номер);
			    ИначеЕсли ТипЗНЧ(Стр.ПредыдущийЛН) = Тип("ДокументСсылка.ЛистокНетрудоспособности") Тогда
			    	СсылкаНаЛН = Стр.ПредыдущийЛН;  
			    КонецЕсли;	
		    	Если СсылкаНаЛН = Документы.ЛистокНетрудоспособности.ПустаяСсылка() Тогда //ошибка при пустой ссылке 
					Стр.ПредыдущийЛН = "";
			    	Счетчик = Счетчик -1;
		    	Иначе
			    	ОбъектЛН = СсылкаНаЛН.ПолучитьОбъект();
			    	ДниПредБл = (НачалоДня(ОбъектЛН.ДатаОкончания) - НачалоДня(ОбъектЛН.Запись1ДатаНачала)) / (60 * 60 * 24);
			    	Стр.Дни = Стр.Дни + ДниПредБл + 1;
					Стр.ПервичныйЛисток = СсылкаНаЛН;
			    	Если ОбъектЛН.ДокументОснование <> Неопределено Тогда
				    	Стр.ПредыдущийЛН = ОбъектЛН.ДокументОснование; 
				    Иначе
				        Стр.ПредыдущийЛН = "";
				    	Счетчик = Счетчик -1;
				    КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
	 КонецЦикла;
	
	 Для Каждого Стр из Результат Цикл
		 Для Каждого БЛ из БЛДни Цикл
			 Если Стр.Документ = БЛ.ЛистНетрудоспособности Тогда
				Стр.Документ = БЛ.ПервичныйЛисток;
				Стр.КоличествоДней = Стр.КоличествоДней + БЛ.Дни;
			 КонецЕсли;	 
		 КонецЦикла;	 
	 КонецЦикла;
	
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьГруппыВТекстЗапроса(Текст, Знач Группы)
	Если ЗначениеЗаполнено(Группы) Тогда
		Если Лев(Группы,1) = "ж" Тогда
			Текст = Текст + " И СписокДиагнозов.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическихЛиц.Женский) ";
			Группы = СтрЗаменить(Группы,"ж","");
		Иначе
			Текст = Текст + " И СписокДиагнозов.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическихЛиц.Мужской) ";	
		КонецЕсли; 
		
		Если Группы = "A00-O99,Q00-Q99,S00-T98,U07.1,U07.2,Z00-Z99" Тогда
		    Текст = Текст + " И НЕ СписокДиагнозов.ПричинаНетрудоспособностиКод = ""05""";
		КонецЕсли;	
		
		Если Группы = "Z20.8,Z22.8,Z29.0" Тогда
				Текст = Текст + " И СписокДиагнозов.ПричинаНетрудоспособностиКод = ""03""";  
		КонецЕсли;		
		
		Если Лев(Группы,1) = "0" Тогда 
		    Текст = Текст + " И СписокДиагнозов.ПричинаНетрудоспособностиКод = """ + Группы + """";
			Если Группы = "08" Тогда
				Текст = Текст + " И (СписокДиагнозов.КодДиагноза < ""I20"" ИЛИ СписокДиагнозов.КодДиагноза > ""I25.9"") ";  
			КонецЕсли; 
		Иначе 	 
			Если Группы = "I00-I99" Или Группы = "I20-I25" Тогда
				Текст = Текст + "И НЕ СписокДиагнозов.ПричинаНетрудоспособностиКод В (""09"", ""03"", ""05"")";  
			ИначеЕсли Не (Группы = "Z20.8,Z22.8,Z29.0" Или Группы = "A00-O99,Q00-Q99,S00-T98,U07.1,U07.2,Z00-Z99") Тогда
				Текст = Текст + "И НЕ СписокДиагнозов.ПричинаНетрудоспособностиКод В (""09"", ""08"", ""03"", ""05"")";  
			КонецЕсли;
			
			Текст = Текст + " И ("; 
			МассивГрупп = СтрРазделить(Группы, ",", Ложь);
			Для каждого Группа Из МассивГрупп Цикл
				МассивКодов = СтрРазделить(Группа, "-", Ложь);
				СтрокаУсловия = " СписокДиагнозов.КодДиагноза >= """ + МассивКодов[0] + """";
				Если СтрДлина (МассивКодов[0])<> 3 Тогда
					СтрокаУсловия = " СписокДиагнозов.КодДиагноза = """ + МассивКодов[0] + """";
				Иначе
				    ПослЭлем = МассивКодов.Количество()-1;
		            КодКонец = МассивКодов[ПослЭлем] + ".9";
					СтрокаУсловия = СтрокаУсловия + "И СписокДиагнозов.КодДиагноза <= """ + КодКонец + """";
                КонецЕсли;	
				Текст = Текст +	СтрокаУсловия + " ИЛИ ";
			КонецЦикла;
		    Текст = Текст +	"ЛОЖЬ)";
		КонецЕсли;
		
	КонецЕсли;
КонецФункции

#КонецОбласти
